[{"html_name": "index.html", "js_description": "Navigation menu sliding effects, carousel for featured courses, form handling for newsletter subscription, and smooth scrolling for anchor links.", "description": "This is the main landing page of the school website that introduces the school and its IT training programs, providing visitors with an overview of available courses, faculty, and the school's mission. The page aims to engage visitors with interactive elements and easy navigation.", "relationship": {"buttons": [{"button_name": "Courses", "jump_page": "courses.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Login", "jump_page": "login.html"}, {"button_name": "Register", "jump_page": "register.html"}, {"button_name": "Blog", "jump_page": "blog.html"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}, {"link_name": "FAQ", "jump_page": "faq.html"}]}, "practice_features": "Newsletter subscription form, navigation menu, featured courses carousel, and interactive testimonials.", "additional_features": "Carousel for student testimonials, quick links to popular courses, interactive map for school location, and a section for upcoming events.", "page_style": "Consistent header and footer with navigation links, a large banner image at the top, clean and modern design with a focus on blue and white colors. Subtle animations when scrolling and hovering over elements to enhance user experience.", "is_main_page": true}, {"html_name": "courses.html", "js_description": "Dynamic course filtering and sorting, course detail modal pop-ups, and interactive course enrollment.", "description": "This page lists all the IT courses offered by the school, with detailed descriptions and filtering options. Users can browse through various courses, read detailed descriptions, view ratings, and enroll directly from the page.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Login", "jump_page": "login.html"}, {"button_name": "Enroll Now", "action": "enrollCourse()"}, {"button_name": "View Cart", "jump_page": "cart.html"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}, {"link_name": "FAQ", "jump_page": "faq.html"}]}, "practice_features": "Course filtering and sorting, course detail modals, interactive course enrollment, and user authentication checks.", "additional_features": "Student reviews and ratings for each course, wishlist functionality, and downloadable course brochures. Visual indicators for course popularity and new courses.", "page_style": "Consistent with the main page, with a focus on course cards and filtering options. Uses a clean and modern design with intuitive navigation and vibrant color schemes to highlight course categories.", "is_main_page": false}, {"html_name": "about.html", "js_description": "Team member bio pop-ups, timeline animations, hover effects on team photos, and smooth scrolling.", "description": "This page provides comprehensive information about the school's mission, vision, values, and the dedicated team behind it. It aims to build trust and connect with prospective students, parents, and partners.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Courses", "jump_page": "courses.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Login", "jump_page": "login.html"}, {"button_name": "Our Achievements", "jump_page": "achievements.html"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}, {"link_name": "FAQs", "jump_page": "faqs.html"}]}, "practice_features": "Team member bios, mission and vision statements, interactive timeline of the school's history.", "additional_features": "Detailed timeline of school history, testimonials from students and parents, interactive map showing the school's location and nearby facilities.", "page_style": "Consistent with the main page, with an emphasis on team photos and a timeline display. The design includes vibrant colors, professional typography, and a user-friendly layout.", "is_main_page": false}, {"html_name": "contact.html", "js_description": "Form validation, Google Maps integration, real-time chat support.", "description": "This page allows visitors to contact the school via a form, find the school’s location on a map, and get real-time assistance through live chat support. The form includes fields for name, email, subject, and message, with validation to ensure all fields are properly filled out. The embedded Google Maps provides an interactive way for visitors to locate the school.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Courses", "jump_page": "courses.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Login", "jump_page": "login.html"}, {"button_name": "Submit", "action": "submitForm()"}, {"button_name": "Reset", "action": "resetForm()"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}]}, "practice_features": "Contact form with validation, Google Maps integration, live chat support, form submission and reset functionality.", "additional_features": "Live chat support with real-time response, contact form with CAPTCHA to prevent spam, tooltips for form fields to guide users on what information is required.", "page_style": "Consistent with the main page, featuring a clean and professional form layout with rich background colors. The map is embedded seamlessly, and the live chat button is prominently displayed.", "is_main_page": false}, {"html_name": "login.html", "js_description": "Form validation, password recovery options, dynamic error messaging, and real-time input feedback.", "description": "This page allows students and staff to log in to their accounts. It features a secure and user-friendly login form with options for password recovery and remembering login details. The page ensures that users can access their personal dashboards seamlessly.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Courses", "jump_page": "courses.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Forgot Password", "jump_page": "password_recovery.html"}, {"button_name": "Sign Up", "jump_page": "signup.html"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}]}, "practice_features": "Login form with validation, password recovery, remember me option, and real-time input feedback.", "additional_features": "Option to remember login details, Google and Facebook social login integration, CAPTCHA for added security.", "page_style": "Consistent with the main page, focusing on form layout with a clean and modern design. The page uses subtle animations and transitions to enhance user experience.", "is_main_page": false}, {"html_name": "privacy.html", "js_description": "None", "description": "This page provides the privacy policy of the school, detailing how user data is collected, used, and protected. It also outlines the rights of users regarding their personal information.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Courses", "jump_page": "courses.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Login", "jump_page": "login.html"}, {"button_name": "Terms of Service", "jump_page": "terms.html"}], "links": []}, "practice_features": "Privacy policy text, user rights information, data protection measures.", "additional_features": "Frequently Asked Questions section about privacy, contact form for privacy-related inquiries, downloadable PDF of the privacy policy.", "page_style": "Consistent with the main page, text-oriented layout with clear headings and subheadings for easy navigation. Use of icons to highlight key points. Soft background colors to ensure readability.", "is_main_page": false}, {"html_name": "terms.html", "js_description": "None", "description": "This page provides the terms of service of the school, outlining the rules, regulations, and agreements that users must adhere to while using the school's services. It ensures transparency and sets clear expectations for both students and staff.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Courses", "jump_page": "courses.html"}, {"button_name": "About Us", "jump_page": "about.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Login", "jump_page": "login.html"}, {"button_name": "Privacy Policy", "jump_page": "privacy.html"}], "links": []}, "practice_features": "Detailed terms of service text with sections for user responsibilities, intellectual property rights, and limitation of liability.", "additional_features": "Table of contents for easy navigation, linkable sections for quick access to specific terms, and a downloadable PDF version of the terms of service.", "page_style": "Consistent with the main page, text-oriented layout with clear headings and subheadings, making it easy to read and navigate.", "is_main_page": false}]