[{"html_name": "index.html", "js_description": "Interactive elements such as animated buttons, dynamic content loading, and form validation. Includes smooth scrolling effects and modal pop-ups for detailed information.", "description": "The main landing page of the IT School admission website. This page serves as the gateway to all other sections, providing an overview of the school, its mission, and the courses offered.", "relationship": {"buttons": [{"button_name": "Apply Now", "jump_page": "application_form.html"}, {"button_name": "Courses", "jump_page": "courses.html"}, {"button_name": "About Us", "jump_page": "about_us.html"}, {"button_name": "Contact", "jump_page": "contact.html"}, {"button_name": "Student Portal", "jump_page": "student_portal.html"}], "links": [{"link_name": "Privacy Policy", "jump_page": "privacy_policy.html"}, {"link_name": "Terms of Service", "jump_page": "terms_of_service.html"}, {"link_name": "FAQ", "jump_page": "faq.html"}]}, "practice_features": "Search bar for quick navigation, a carousel for featured courses, interactive map showing campus locations.", "additional_features": "Testimonials section, newsletter subscription form, video introduction to the school, social media integration.", "page_style": "Modern and clean style with a consistent color palette (blues and whites), responsive design, and large, readable fonts. Consistent header and footer across all pages. Includes subtle animations and transitions to enhance user experience.", "is_main_page": true}, {"html_name": "application_form.html", "js_description": "Form validation, dynamic form fields based on user inputs, and submission confirmation. Provides real-time feedback on form completion and highlights any errors or missing fields.", "description": "The application form page where prospective students can apply for admission. The form captures essential details such as personal information, educational background, and preferred courses, ensuring a comprehensive application process.", "relationship": {"buttons": [{"button_name": "Submit", "jump_page": "submission_confirmation.html"}, {"button_name": "Save for Later", "action": "saveFormProgress()"}, {"button_name": "Clear Form", "action": "clearFormFields()"}], "links": [{"link_name": "Back to Home", "jump_page": "index.html"}, {"link_name": "Help", "jump_page": "help.html"}]}, "practice_features": "Detailed form with sections for personal information, education background, and course selection. Supports auto-save functionality to prevent data loss and allows users to continue later.", "additional_features": "Progress bar for form completion, tooltips for form fields. Responsive design ensuring usability across devices, real-time validation, and dynamic field adjustments based on user inputs.", "page_style": "Consistent with main page, with a focus on usability and readability. Clean and uncluttered form layout with intuitive navigation and clear section separations. Enhanced with subtle animations and visual cues to guide the user.", "is_main_page": false}, {"html_name": "courses.html", "js_description": "Interactive course catalog with expandable sections for course details. Includes search, filter, and sorting functionalities for enhanced user experience.", "description": "This page lists all the courses offered by the IT School, providing comprehensive details about each course. Users can explore courses, read detailed descriptions, check reviews and ratings, and apply directly from this page.", "relationship": {"buttons": [{"button_name": "Apply Now", "jump_page": "application_form.html"}, {"button_name": "Sort by Name", "action": "sortCourses('name')"}, {"button_name": "Sort by Duration", "action": "sortCourses('duration')"}, {"button_name": "Sort by Popularity", "action": "sortCourses('popularity')"}, {"button_name": "Load More", "action": "loadMoreCourses()"}], "links": [{"link_name": "Back to Home", "jump_page": "index.html"}]}, "practice_features": "Search and filter functionality for courses, expandable course details, sorting options by name, duration, and popularity.", "additional_features": "Course ratings and reviews, instructor profiles, related courses suggestions, real-time availability status, and a 'Load More' button to dynamically load additional courses.", "page_style": "Consistent with main page, grid layout for courses with rich visual elements, expandable sections for details, and interactive hover effects.", "is_main_page": false}, {"html_name": "about_us.html", "js_description": "Interactive elements like team member profiles with hover effects and a dynamic timeline illustrating the school's history.", "description": "This page provides comprehensive information about the IT School, showcasing its mission, values, history, and the dedicated team behind its success. It aims to give prospective students and their families a thorough understanding of what the school stands for and its journey over the years.", "relationship": {"buttons": [{"button_name": "Contact Us", "jump_page": "contact.html"}, {"button_name": "Meet the Team", "action": "scrollToSection('team')"}, {"button_name": "Our History", "action": "scrollToSection('history')"}], "links": [{"link_name": "Back to Home", "jump_page": "index.html"}]}, "practice_features": "Detailed information about the school's mission, history, and team members. Interactive profiles and historical timeline.", "additional_features": "Interactive timeline with key milestones, team member profiles with hover effects revealing more details, testimonial slider showcasing feedback from students and parents.", "page_style": "Consistent with the main page, featuring a professional and informative layout. Use of high-quality images, rich background colors, and a clear, readable font to enhance user experience.", "is_main_page": false}, {"html_name": "contact.html", "js_description": "Interactive contact form with validation, map integration for location, and real-time form feedback.", "description": "The contact page features a user-friendly form for inquiries, complete with input validation and real-time feedback. The page also includes an interactive map showing the school's location, making it easy for prospective students and visitors to find us.", "relationship": {"buttons": [{"button_name": "Send Message", "jump_page": "contact_confirmation.html"}, {"button_name": "Clear Form", "action": "clearForm()"}], "links": [{"link_name": "Back to Home", "jump_page": "index.html"}, {"link_name": "Admissions", "jump_page": "admissions.html"}]}, "practice_features": "Contact form with fields for name, email, subject, and message, including real-time validation and feedback.", "additional_features": "Embedded Google Map showing the school's location, tooltips for form fields, and a FAQ section for common inquiries.", "page_style": "Consistent with main page, focusing on accessibility and user-friendliness. Utilizes a clean layout with ample white space and intuitive navigation.", "is_main_page": false}, {"html_name": "privacy_policy.html", "js_description": "Static informational content ensuring transparency in data handling and user privacy.", "description": "This page outlines the privacy policy of the IT School, providing detailed information on how user data is collected, used, and protected. It aims to build trust with users by clearly stating the school's commitment to privacy.", "relationship": {"buttons": [{"button_name": "Accept Terms", "action": "acceptTerms()"}, {"button_name": "Decline", "action": "declineTerms()"}], "links": [{"link_name": "Back to Home", "jump_page": "index.html"}, {"link_name": "Contact Us", "jump_page": "contact.html"}]}, "practice_features": "Comprehensive privacy policy details, user data protection measures, consent options.", "additional_features": "Interactive consent buttons for accepting or declining the privacy policy terms. Hyperlinks for quick navigation to related information like contact and legal details. FAQ section addressing common privacy concerns.", "page_style": "Consistent with the main page, featuring a simple, text-focused layout with clear headings and subheadings for easy readability. Subtle background colors to enhance focus on the text.", "is_main_page": false}, {"html_name": "terms_of_service.html", "js_description": "Static informational content with smooth scrolling and interactive elements for better user experience.", "description": "Page outlining the terms of service of the IT School, providing detailed information on the terms and conditions that users must agree to in order to enroll in the school's programs.", "relationship": {"buttons": [{"button_name": "Accept Terms", "action": "acceptTerms()"}, {"button_name": "Decline Terms", "action": "declineTerms()"}], "links": [{"link_name": "Back to Home", "jump_page": "index.html"}, {"link_name": "Privacy Policy", "jump_page": "privacy_policy.html"}]}, "practice_features": "Detailed terms of service information, user acceptance functionality.", "additional_features": "Interactive table of contents for easy navigation, tooltips for legal terms, print-friendly version.", "page_style": "Consistent with main page, simple, text-focused layout with a clean and professional design. Use of subtle colors and ample whitespace to enhance readability.", "is_main_page": false}, {"html_name": "submission_confirmation.html", "js_description": "Display confirmation message, provide navigation options, and show additional details about the submission.", "description": "Page confirming the submission of an application form, providing users with a clear acknowledgment and further steps or information regarding their application.", "relationship": {"buttons": [{"button_name": "Back to Home", "jump_page": "index.html"}, {"button_name": "Submit Another Application", "jump_page": "application_form.html"}, {"button_name": "View Submitted Applications", "jump_page": "submitted_applications.html"}], "links": [{"link_name": "Main Page", "jump_page": "index.html"}, {"link_name": "Contact Us", "jump_page": "contact.html"}]}, "practice_features": "Confirmation message displaying submission details, including date and time of submission, and application ID for reference.", "additional_features": "Friendly tips for next steps, links to related resources, and options to download a copy of the submission receipt.", "page_style": "Consistent with main page, simple and clear confirmation message with a touch of celebratory design. Use of icons and accent colors to enhance user experience.", "is_main_page": false}, {"html_name": "contact_confirmation.html", "js_description": "Display confirmation message and provide navigation options. Includes animations to enhance user experience.", "description": "This page confirms the successful submission of a contact form, providing a clear and concise message to the user. It offers options to navigate back to the home page or access other important sections of the website.", "relationship": {"buttons": [{"button_name": "Back to Home", "jump_page": "index.html"}, {"button_name": "Submit Another Response", "jump_page": "contact_form.html"}, {"button_name": "Visit FAQ", "jump_page": "faq.html"}], "links": [{"link_name": "Main Page", "jump_page": "index.html"}, {"link_name": "Contact Us", "jump_page": "contact_form.html"}, {"link_name": "FAQ", "jump_page": "faq.html"}]}, "practice_features": "Confirmation message displaying submission details, navigation to other pages.", "additional_features": "Provides options to submit another response or visit the FAQ section for further assistance. Includes a thank you animation.", "page_style": "Consistent with the main page, featuring a simple and clear confirmation message. Utilizes a clean and professional design with subtle animations.", "is_main_page": false}]