[{"html_name": "index.html", "js_description": "Handle button clicks to navigate to different pages, validate user login, display user-specific dashboard on login. Implement animations for form submission feedback.", "description": "The main landing page that includes login and sign-up options. Users can access the project management dashboard upon successful login or create a new account.", "relationship": {"buttons": [{"button_name": "Login", "jump_page": "dashboard.html"}, {"button_name": "Sign Up", "jump_page": "signup.html"}, {"button_name": "Contact Support", "jump_page": "contact.html"}], "links": [{"link_name": "Learn More", "jump_page": "about.html"}, {"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}]}, "practice_features": "User authentication, form validation, redirect to dashboard on successful login, animated transitions for form submissions.", "additional_features": "Remember me functionality, forgot password link, social media login options (Google, Facebook), tooltips for form input fields.", "page_style": "Clean, modern design with a focus on usability. Header with logo, centered form, and footer with links. Use of material design principles with elevated cards for the form, smooth animations, and responsive layout for mobile and desktop views.", "is_main_page": true}, {"html_name": "dashboard.html", "js_description": "Display user projects, allow navigation to project details, enable CRUD operations for projects, and provide real-time updates on project statuses.", "description": "User dashboard that displays all active projects and allows user to manage them. This page serves as the central hub for users to oversee their projects, track progress, and make necessary updates.", "relationship": {"buttons": [{"button_name": "New Project", "jump_page": "new_project.html"}, {"button_name": "View Project", "jump_page": "project_details.html"}, {"button_name": "Edit Project", "action": "editProject()"}, {"button_name": "Delete Project", "action": "deleteProject()"}, {"button_name": "Refresh", "action": "refreshDashboard()"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Settings", "jump_page": "settings.html"}, {"link_name": "Profile", "jump_page": "profile.html"}]}, "practice_features": "Project list display, project CRUD operations, user-specific content, real-time status updates, quick actions for project management.", "additional_features": "Search and filter functionality for projects, real-time notifications for project updates, drag-and-drop functionality for project reordering, and customizable project views.", "page_style": "Consistent with main page, but with a sidebar for navigation and a main content area for project details. Modern design with intuitive icons and tooltips for better user experience.", "is_main_page": false}, {"html_name": "signup.html", "js_description": "Handle user registration, validate input fields, display error messages if any. Provide real-time feedback on input validation such as email format, password strength, and required fields.", "description": "User sign-up page to create a new account. The page includes a registration form where users need to fill in their personal information like name, email, password, and confirm password. The page ensures that all mandatory fields are filled correctly before allowing the user to create an account.", "relationship": {"buttons": [{"button_name": "Sign Up", "jump_page": "dashboard.html"}, {"button_name": "Reset", "action": "resetForm()"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Login", "jump_page": "login.html"}]}, "practice_features": "User registration, form validation, error handling, real-time feedback.", "additional_features": "Password strength indicator, tooltips for input fields, real-time email validation, terms and conditions checkbox.", "page_style": "Similar to the main page with a centered registration form and consistent header and footer. The form has a clean and modern design with clear labels and input fields. Error messages are displayed in red below the respective input fields.", "is_main_page": false}, {"html_name": "new_project.html", "js_description": "Enable creation of a new project, validate input fields, handle form submission, provide real-time feedback on input validity.", "description": "This page allows users to create a new project by filling out a form with necessary details such as project name, description, start date, end date, and team members. The form ensures all required fields are completed and provides real-time validation feedback.", "relationship": {"buttons": [{"button_name": "Create Project", "jump_page": "dashboard.html"}, {"button_name": "Cancel", "jump_page": "dashboard.html"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Dashboard", "jump_page": "dashboard.html"}]}, "practice_features": "Project creation form, input validation, real-time feedback.", "additional_features": "Auto-save drafts, project template options, option to assign team members, file attachment support for project-related documents.", "page_style": "Consistent with the other pages, form-centered layout with header and footer. Clean and modern design with emphasis on usability. Uses a two-column layout with the form on the left and a summary on the right.", "is_main_page": false}, {"html_name": "project_details.html", "js_description": "Display project details, enable editing and updating of project information, handle task management within the project. Include dynamic updates for project status and real-time collaboration features.", "description": "This page provides a comprehensive view of a specific project's details, including tasks, team members, milestones, and deadlines. Users can manage tasks, update project information, and view an activity log. The page supports real-time collaboration, allowing team members to see updates instantly.", "relationship": {"buttons": [{"button_name": "Edit Project", "jump_page": "edit_project.html"}, {"button_name": "Delete Project", "jump_page": "dashboard.html"}, {"button_name": "Add Task", "jump_page": "add_task.html"}, {"button_name": "View Gantt Chart", "jump_page": "gantt_chart.html"}, {"button_name": "Back to Dashboard", "jump_page": "dashboard.html"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Team Members", "jump_page": "team_members.html"}, {"link_name": "Project Settings", "jump_page": "project_settings.html"}]}, "practice_features": "Display project details, task management, project editing, real-time updates, and collaboration tools.", "additional_features": "Comments section, activity log, file attachments, project timeline, project status indicators, and notifications.", "page_style": "Detailed view with sections for different project information, consistent header and footer. The layout includes a sidebar for quick navigation, a main content area for detailed information, and a top bar for notifications and user actions.", "is_main_page": false}, {"html_name": "edit_project.html", "js_description": "Enable editing of project details, validate input fields, handle form submission, provide instant feedback on input errors.", "description": "This page allows users to edit the details of an existing project. It includes a form with various input fields for project information such as title, description, start date, end date, and assigned team members. Users can save their changes or discard them.", "relationship": {"buttons": [{"button_name": "Save Changes", "jump_page": "project_details.html"}, {"button_name": "Cancel", "jump_page": "project_details.html"}, {"button_name": "Delete Project", "action": "deleteProject()"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Project List", "jump_page": "project_list.html"}]}, "practice_features": "Form for editing project details, input validation, real-time feedback on input errors, auto-save feature.", "additional_features": "Version history, undo changes, auto-save drafts, confirmation modal for deleting a project.", "page_style": "Simple and modern design with a form-centered layout, consistent header and footer, responsive design for mobile and desktop views.", "is_main_page": false}, {"html_name": "about.html", "js_description": "Display information about the website and its features, including interactive elements for team profiles and contact forms.", "description": "The About page provides comprehensive information about the project management tool, its purpose, key features, and the team behind it. Users can learn about the tool's benefits, explore team member profiles, and contact the team directly.", "relationship": {"buttons": [{"button_name": "Contact Us", "action": "openContactForm()"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Features", "jump_page": "features.html"}, {"link_name": "Pricing", "jump_page": "pricing.html"}]}, "practice_features": "Information display, team profiles, contact form.", "additional_features": "Interactive team member profiles with hover effects, a fully functional contact form with validation, and an FAQ section.", "page_style": "Informational layout with sections for different types of content, consistent header and footer. Clean and professional design with a focus on readability and user engagement.", "is_main_page": false}]