[{"html_name": "index.html", "js_description": "Handle navigation, featured video playback, and dynamic content loading for a seamless user experience.", "description": "This is the main page where users can see featured videos and navigate to different sections of the website. It serves as the central hub, offering quick access to various functionalities like browsing, uploading, and logging in.", "relationship": {"buttons": [{"button_name": "Featured Video", "jump_page": "video.html"}, {"button_name": "Browse Videos", "jump_page": "browse.html"}, {"button_name": "Upload Video", "jump_page": "upload.html"}, {"button_name": "Login", "jump_page": "login.html"}, {"button_name": "Sign Up", "jump_page": "signup.html"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Contact Us", "jump_page": "contact.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}, {"link_name": "Privacy Policy", "jump_page": "privacy.html"}]}, "practice_features": "Display a carousel of featured videos, navigation bar, search bar, and user authentication options.", "additional_features": "Include a footer with contact information, social media links, and subscribe to newsletter option. Real-time notifications for user interactions.", "page_style": "Modern, clean layout with a consistent color scheme of blue and white, and a responsive design to fit various screen sizes. Smooth transitions and animations for a polished look.", "is_main_page": true}, {"html_name": "video.html", "js_description": "Handle video playback, related video suggestions, comments section, and user interactions such as liking, sharing, and subscribing.", "description": "This page is dedicated to playing a selected video and displaying a curated list of related videos. Users can interact with the video by liking, sharing, and subscribing. The page also includes a comments section where users can discuss the video.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Browse Videos", "jump_page": "browse.html"}, {"button_name": "Like", "action": "likeVideo()"}, {"button_name": "Share", "action": "shareVideo()"}, {"button_name": "Subscribe", "action": "subscribeChannel()"}, {"button_name": "Full Screen", "action": "toggleFullScreen()"}], "links": [{"link_name": "Home", "jump_page": "index.html"}]}, "practice_features": "Video player, comments section, list of related videos, like button, share button, subscribe button, fullscreen mode.", "additional_features": "Option to like, share, and subscribe. Fullscreen mode for video playback. Video quality adjustment and captions/subtitles support.", "page_style": "Maintain a clean, modern layout with rich background colors, emphasizing usability and readability. The design is responsive to ensure a seamless experience across different devices.", "is_main_page": false}, {"html_name": "browse.html", "js_description": "Handle video searching, filtering, and dynamic update of video listings based on user interactions such as filters, sorting, and pagination.", "description": "This page allows users to browse and search for videos, providing an intuitive interface to find and explore content. Users can filter videos by categories, sort them by various criteria, and easily navigate through different pages of video listings.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Upload Video", "jump_page": "upload.html"}, {"button_name": "Sort by Date", "action": "sortVideos('date')"}, {"button_name": "Sort by Popularity", "action": "sortVideos('popularity')"}, {"button_name": "Previous", "jump_page": "previous_page.html"}, {"button_name": "Next", "jump_page": "next_page.html"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Contact Us", "jump_page": "contact.html"}, {"link_name": "About", "jump_page": "about.html"}]}, "practice_features": "Search bar, video categories, filter options, sorting options, pagination for video listings.", "additional_features": "Advanced filters for search results including video length, resolution, and upload date. Real-time search suggestions as the user types. Thumbnail previews on hover.", "page_style": "Consistent modern design with emphasis on usability and ease of navigation. Clean layout with a focus on video content, using a grid-based design for video thumbnails.", "is_main_page": false}, {"html_name": "upload.html", "js_description": "Handle video file upload and metadata input, including validation and progress tracking.", "description": "This page allows users to upload their own videos, providing an intuitive form for video file selection and metadata input. Users can track the upload progress in real-time and be notified upon successful upload or any errors.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Browse Videos", "jump_page": "browse.html"}, {"button_name": "Submit", "action": "submitUpload()"}, {"button_name": "Cancel", "action": "cancelUpload()"}], "links": [{"link_name": "Home", "jump_page": "index.html"}]}, "practice_features": "File upload form, metadata input fields, real-time upload progress, drag-and-drop file upload.", "additional_features": "Progress bar for upload status, file type and size validation, thumbnail preview of the video, tooltips for metadata fields, and error handling for upload failures.", "page_style": "Maintain the clean, modern layout with an intuitive form design. Use a responsive grid layout to ensure the page works well on both desktop and mobile devices.", "is_main_page": false}, {"html_name": "login.html", "js_description": "Handle user authentication, validate input fields, and provide feedback for login status.", "description": "This page allows users to login to their accounts by entering their username and password. It also offers options for password recovery and quick navigation to the main page and video browsing sections.", "relationship": {"buttons": [{"button_name": "Home", "jump_page": "index.html"}, {"button_name": "Browse Videos", "jump_page": "browse.html"}, {"button_name": "Login", "action": "submitLoginForm()"}, {"button_name": "Create Account", "jump_page": "signup.html"}], "links": [{"link_name": "Home", "jump_page": "index.html"}, {"link_name": "Forgot Password", "jump_page": "forgot_password.html"}, {"link_name": "Privacy Policy", "jump_page": "privacy.html"}, {"link_name": "Terms of Service", "jump_page": "terms.html"}]}, "practice_features": "Login form with username and password fields, submit button, and client-side validation.", "additional_features": "Option for password recovery, link to create a new account, and quick access to privacy policy and terms of service.", "page_style": "Consistent with the overall modern, clean design with a focus on simplicity and ease of use. Features a responsive layout that adapts to different screen sizes and devices.", "is_main_page": false}]